Refactored PlantUML out in Gitlab Pages in
